## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:50" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:50" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:26dab69cf5e4532c579dd63a6e644b2d764b9f9d6fcb6ded8edee127daa8e023" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:ef94b52d2593f614f013ee803d6bbf4c0bc8f3d496decd5e635cb113e009907b"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 50 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "cc4a7830c5ec6f9a59199165eb9075a5-5" -> "1e4683cb85e97d3200d97928196ea632"
      ~ id                     = "cpfValidation.ac5123602e6ca54dfe711dccded70004.zip" -> (known after apply)
      ~ key                    = "cpfValidation.ac5123602e6ca54dfe711dccded70004.zip" -> "cpfValidation.1e4683cb85e97d3200d97928196ea632.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "ac5123602e6ca54dfe711dccded70004" -> "1e4683cb85e97d3200d97928196ea632"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "ogV7z33lhaLICI.DJGOZoNXBCqpg44og" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-excelToJson" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "fed80b89425ef66f5f523d79317ebbfa-6" -> "db2decf258f703af202a664d565cbcd6"
      ~ id                     = "excelToJson.0bb9e449d8f94dcd52dcf474560e69bc.zip" -> (known after apply)
      ~ key                    = "excelToJson.0bb9e449d8f94dcd52dcf474560e69bc.zip" -> "excelToJson.db2decf258f703af202a664d565cbcd6.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "0bb9e449d8f94dcd52dcf474560e69bc" -> "db2decf258f703af202a664d565cbcd6"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "dlj1dJXOLH4HnVlr_fZkq4e4xZr1Tk0." -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "7e19000ebe2f46ddef8857834f056eb3-6" -> "b7c0d9335215f8f41b64860f2b9e98cf"
      ~ id                     = "graphql.334d6fcc246eaa4b344b3ab16a50ac93.zip" -> (known after apply)
      ~ key                    = "graphql.334d6fcc246eaa4b344b3ab16a50ac93.zip" -> "graphql.b7c0d9335215f8f41b64860f2b9e98cf.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "334d6fcc246eaa4b344b3ab16a50ac93" -> "b7c0d9335215f8f41b64860f2b9e98cf"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "2NWv2MdzMzXfJbpuhtnNTHp8V4IGFUih" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "b24ab96662239dc8ee8b418b201ca2e8" -> "ed695e31b9e739399c5c4ffc7941a722"
        id                     = "dist/200.html"
      ~ source_hash            = "b24ab96662239dc8ee8b418b201ca2e8" -> "ed695e31b9e739399c5c4ffc7941a722"
        tags                   = {}
      ~ version_id             = ".mwxehLt5coEWnVU24BZkiYrwqiTgaNY" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "312a8514dc63f92800e8996b101d116d" -> "3886b9b2841e2124f0fea879c3070e43"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "312a8514dc63f92800e8996b101d116d" -> "3886b9b2841e2124f0fea879c3070e43"
        tags                   = {}
      ~ version_id             = ".PwCzT0JEZsOG4T0DvMOSh.YrNgE4oVD" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "daa34bd2cc9f24d6fb6e7fb705aebf8b" -> "165ee22c372ba162f23e00448a5680ca"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "daa34bd2cc9f24d6fb6e7fb705aebf8b" -> "165ee22c372ba162f23e00448a5680ca"
        tags                   = {}
      ~ version_id             = "gqCDl12FsL4LdczjwdgKp_v7aVWsNi9z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "b24ab96662239dc8ee8b418b201ca2e8" -> "ed695e31b9e739399c5c4ffc7941a722"
        id                     = "dist/index.html"
      ~ source_hash            = "b24ab96662239dc8ee8b418b201ca2e8" -> "ed695e31b9e739399c5c4ffc7941a722"
        tags                   = {}
      ~ version_id             = "mL.9luQmdVQyqvw14HVaFAWF7i5hl19s" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.48f4cdcd.js"] will be destroyed
  # (because key ["static/js/app.48f4cdcd.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "9d3057d6181ec9c1ce292955fc51ad61" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.48f4cdcd.js" -> null
-       key                    = "dist/static/js/app.48f4cdcd.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.48f4cdcd.js" -> null
-       source_hash            = "9d3057d6181ec9c1ce292955fc51ad61" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "Uz3bwpK3iVO.4e6kc.SvlWKdZibr_mQE" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.48f4cdcd.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.48f4cdcd.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "9806104531a6dc74425d37448a95fecc" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.48f4cdcd.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.48f4cdcd.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.48f4cdcd.js.LICENSE.txt" -> null
-       source_hash            = "9806104531a6dc74425d37448a95fecc" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "GYicBFVA9fzgN8qYrfZgO3NQl4TPFRaU" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.a2860e25.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "f15abf167ebcb6da979cb68ee9e19ffe"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.a2860e25.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.a2860e25.js"
+       source_hash            = "f15abf167ebcb6da979cb68ee9e19ffe"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.a2860e25.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "9806104531a6dc74425d37448a95fecc"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.a2860e25.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.a2860e25.js.LICENSE.txt"
+       source_hash            = "9806104531a6dc74425d37448a95fecc"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-02-29T19:54:54.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:19" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:19/invocations" -> (known after apply)
      ~ s3_key                         = "cpfValidation.ac5123602e6ca54dfe711dccded70004.zip" -> "cpfValidation.1e4683cb85e97d3200d97928196ea632.zip"
        tags                           = {}
      ~ version                        = "19" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "a6ce263ba131b98f2bc534bdb82ec52ff5a98207" -> "b2f85407439aca2d263926845106e71dcdf10c8d"
              ~ "DD_TAGS"                      = "git.commit.sha:a6ce263ba131b98f2bc534bdb82ec52ff5a98207,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:b2f85407439aca2d263926845106e71dcdf10c8d,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "a6ce263ba131b98f2bc534bdb82ec52ff5a98207" -> "b2f85407439aca2d263926845106e71dcdf10c8d"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "19" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ last_modified                  = "2024-02-29T19:54:54.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:19" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:19/invocations" -> (known after apply)
      ~ s3_key                         = "excelToJson.0bb9e449d8f94dcd52dcf474560e69bc.zip" -> "excelToJson.db2decf258f703af202a664d565cbcd6.zip"
        tags                           = {}
      ~ version                        = "19" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "a6ce263ba131b98f2bc534bdb82ec52ff5a98207" -> "b2f85407439aca2d263926845106e71dcdf10c8d"
              ~ "DD_TAGS"                      = "git.commit.sha:a6ce263ba131b98f2bc534bdb82ec52ff5a98207,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:b2f85407439aca2d263926845106e71dcdf10c8d,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "a6ce263ba131b98f2bc534bdb82ec52ff5a98207" -> "b2f85407439aca2d263926845106e71dcdf10c8d"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "19" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2024-02-29T19:54:54.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:66" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:66/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.334d6fcc246eaa4b344b3ab16a50ac93.zip" -> "graphql.b7c0d9335215f8f41b64860f2b9e98cf.zip"
        tags                           = {}
      ~ version                        = "66" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "a6ce263ba131b98f2bc534bdb82ec52ff5a98207" -> "b2f85407439aca2d263926845106e71dcdf10c8d"
              ~ "DD_TAGS"                            = "git.commit.sha:a6ce263ba131b98f2bc534bdb82ec52ff5a98207,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:b2f85407439aca2d263926845106e71dcdf10c8d,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "a6ce263ba131b98f2bc534bdb82ec52ff5a98207" -> "b2f85407439aca2d263926845106e71dcdf10c8d"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "66" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 9 to add, 8 to change, 9 to destroy.
```

</details>

*Pusher: @Vikariusu, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8116272167)*